---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius.ArcReferenceType
source: html/065c5a62-07b8-a764-13aa-1e512b668ff0.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius.ArcReferenceType Property

A choice of rule for measuring the radius.

## Syntax (C#)
```csharp
public RebarShapeArcReferenceType ArcReferenceType { get; }
```